processor/src/web/web/WEB-INF/classes/META-INF/rnip/doPayment.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><S:Header><wsse:Security S:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/></wsse:Security></S:Header><S:Body wsu:Id="body"><!-- Здесь идёт тело запроса--><n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ UnifoTransferMsg.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n5="http://www.altova.com/samplexml/other-namespace" xmlns:ns1="http://www.bssys.com/xsd/Catalog" xmlns:pirq="http://roskazna.ru/xsd/PGU_ImportRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:smev2="http://roskazna.ru/SmevUnifoService/" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:org="http://roskazna.ru/xsd/Organization" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><smev:Message><smev:Sender><smev:Code>00402</smev:Code><smev:Name>ГУП Перовский школьник</smev:Name></smev:Sender><smev:Recipient><smev:Code>9500</smev:Code><smev:Name>RNIP</smev:Name></smev:Recipient><smev:Originator><smev:Code/><smev:Name>String</smev:Name></smev:Originator><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-12-27T17:36:47.0Z</smev:Date><smev:ExchangeType>String</smev:ExchangeType><smev:RequestIdRef>String</smev:RequestIdRef><smev:OriginRequestIdRef>String</smev:OriginRequestIdRef><smev:ServiceCode>String</smev:ServiceCode><smev:CaseNumber>String</smev:CaseNumber><smev:TestMsg>String</smev:TestMsg></smev:Message><smev:MessageData><smev:AppData><unifo:ImportData><pirq:ImportRequest><PostBlock><ID>254510</ID><TimeStamp>2001-12-17T09:30:47.0Z</TimeStamp><SenderIdentifier>00402</SenderIdentifier></PostBlock><Charge SupplierBillID="M0040200000000000024" Version="2.4.4"><BillDate>2012-01-10</BillDate><SupplierOrgInfo><Name>ГУП «Перовский школьник»</Name><INN>7720003223</INN><KPP>772001001</KPP><Account><Account>40602810938120000007</Account><Bank><Name>ОАО Сбербанка России г. Москва</Name><BIK>044525225</BIK></Bank></Account></SupplierOrgInfo><BillFor>Оплата питания школьника</BillFor><TotalAmount>100</TotalAmount><AdditionalData><Name>NUM_DOGOVOR</Name><Value>600015</Value></AdditionalData><AdditionalData><Name>SRV_CODE</Name><Value>AAAAA004020000000001</Value></AdditionalData><ChangeStatus>1</ChangeStatus><TreasureBranch>ГУП «Перовский школьник»</TreasureBranch><KBK>12407024351203611340</KBK><OKATO>92401000000</OKATO><BudgetIndex><Status>0</Status><PaymentType>0</PaymentType><Purpose>0</Purpose><TaxPeriod>0</TaxPeriod><TaxDocNumber>0</TaxDocNumber><TaxDocDate>0</TaxDocDate></BudgetIndex><!--<UnifiedPayerIdentifier>100000000000</UnifiedPayerIdentifier>--></Charge></pirq:ImportRequest></unifo:ImportData></smev:AppData></smev:MessageData></n1:UnifoTransferMsg><!-- --></S:Body></S:Envelope>